{
    "dreamer": "izzy22", 
    "description": "Izzy,  age 22 [n=53]", 
    "dreams": [
        {
            "number": "3976", 
            "head": "2013-01-26 (22)", 
            "content": "Somehow, Tyrion (Game of Thrones) and I were romantically involved. We would sneak off to these other castle buildings -- there was a big castle thing which was the main place and then there were lots of little buildings around. We were sitting in one, holding each other and talking. He wanted to give up his inheritance to run off with me. Later, we walked out of the castle together and people were watching, so I said \"I'll go walk around and meet you\" and smiled. We split up and I walked to the right to walk around the buildings and go through a back entrance. Some people followed me though."
        }, 
        {
            "number": "3977", 
            "head": "2013-01-26 (22)", 
            "content": "I had a job at 4.30am. I was telling Mom that I needed 'Aero Grad' and a thing to kill bugs. Darren was in bed and saying they would get some and I was like 'before 4.30am?'. Mom was getting ready to meet someone. I realized it was 6.30am and that it was too late now. Then I realized the job was actually next week. We lived in an apartment block and there was some dodgy guy on the roof and the police had the building surrounded."
        }, 
        {
            "number": "3978", 
            "head": "2013-02-01 (22)", 
            "content": "I woke up with my tooth loose in my mouth. I ran my tongue over my teeth, but couldn't work out where it had come from. I looked in the mirror and half of my bottom teeth were missing -- on the right side, I had a back tooth and the first non-molar, and on the left side I had random gaps. I couldn't feel any difference with my tongue though. I went to Mom and was telling her and I broke down, crying. She hugged me and seemed visibly distressed for me."
        }, 
        {
            "number": "3979", 
            "head": "2013-02-03 (22)", 
            "content": "I was at home, alone, at night. I heard weird noises and caught a glimpse of someone out the back. I text Mom and told her to hurry home. I was sitting on my bed. Then I heard more noise and a guy came into my room. He was quite tall and blonde and was wearing a silver wedding ring and had big hands. He crouched at the bottom of my bed and said he wasn't going to hurt me. He started talking about something random that seemed vaguely familiar. I heard Darren's scooter pull up outside and he asked what it was and I asked if I could check if the light had gone on outside. I opened my curtain and said that Darren was back. He took my mouse as a 'hostage' and walked off. I pulled it out of the computer as he walked away so it wouldn't pull and said 'no, please'. He went out the back and said he needed to stay for a while. I went out to greet Darren. The guy turned on the back light and walked outside the window in the back room. Darren didn't seem fazed. He stayed a while (days or something), and he was kind of cute and I would keep looking at him and he'd look at me and I'd look away. There was some tension there. One night he kissed me and I resisted, but he kept going and I gave in and we had sex. There was some movie set on this boat. The people finally managed to escape and got onto a lifeboat and started going towards this thing, but someone shot it and it exploded. Some people landed in the water and they got trapped by this spiky defense mechanism."
        }, 
        {
            "number": "3980", 
            "head": "2013-02-09 (22)", 
            "content": "I was at the shops and it was busy. Nana was there, but she was going senile or something and kept staring into the distance or would just walk off. I kept losing her. We went down to the carpark and I tried to get her to stay in the car. Then I was home, but it was different. There was a pink and nicely decorated letter at the door for me. It was from Zander. I then had a 6 year old daughter, which I'd had with Zander -- we had had sex at school and I'd had an abortion by taking a bunch of pills, but somehow the kid came back. Some guy was wearing a shirt from The Mercenary. I thought it was cool and was talking to him outside."
        }, 
        {
            "number": "3981", 
            "head": "2013-02-17 (22)", 
            "content": "I was at a stocktaking job at an IGA. I had done this one before but didn't realize until I went in. There was a muffin shop next door and there was a guy dressed as a muffin and dancing around. Esther joked that this job would take 30 hours. We had trolleys to take around with us. Elijah was there. I went to an aisle but had forgotten to put my stuff down and get a scanner."
        }, 
        {
            "number": "3982", 
            "head": "2013-02-23 (22)", 
            "content": "I was at Leederville IGA [I had to cancel the job which was tomorrow]. I was having trouble with my sore arm and after 2 hours I was still stuck on the same shelf and kept knocking stuff off. I was having problems with the ladder too. Calvin was there. I went to get Co-Worker-F-02 to ask her to go home. She was upstairs at the back of the store. There were bedrooms and hers was empty and the light was off. I heard a noise and went back to the stairs but then she came out of one of the other rooms in a costume -- it was Halloween? She said she would normally cover up with makeup when she was dressed up, but this costume covered up her face and I said \"it saves time\". I explained to her about my arm, but she just got some other people to do my shelf and I was unsure of whether I could leave or not."
        }, 
        {
            "number": "3983", 
            "head": "2013-03-01 (22)", 
            "content": "I was working at the bar, which was different. A guy asked for a Corona with lemon, and it was actually this weird thing that I had to mix with baked beans, but I think he just wanted lemonade and a cake. The queue was building up and I saw Cute Irish Guy (Kieran) there. He had a name badge on saying 'Lincoln F', which I thought was a weird name for an Irish bloke and wondered what his last name was. I finished making the Corona and left it. I gave Kieran his Budweiser and as he gave me a $20 note, his fingers lingered on mine. He said his usual \"thank you very much\" and walked off without his change. I put it aside. There was a gambling thing going on upstairs. The guy hadn't come back for his Corona thing and someone said he'd won the jackpot and left. An Asian lady told me to follow her through what looked like a ventilation system. I tied my hair back and people queued up behind me impatiently. I started climbing through and some parts squished my head. Climbing down pipes was easier and then it was like a game. I got to the bottom and then the lady was like 'just up here' and it was a long way up. I couldn't be bothered with it and 'paused' the game for now."
        }, 
        {
            "number": "3984", 
            "head": "2013-03-05 (22)", 
            "content": "I lived at a house with Mom near some woods. Outside we had a self-serve petrol station. It was night. I pulled in and filled up my tank. The neighbours across the road were outside in groups complaining to themselves loudly about our porch light. We turned it off and yelled out 'you could've just asked us, retards!'. Then they left their porch light on. Later, we were both in bed (we were sharing a bed) and Rover was there too. I heard a guy outside talking with a young girl (6 years old or so). I nudged Mom and told her the window was open. She didn't get up, so I finally got up and closed it. The voice was Stephen Merchant's, but it was the past, before he got famous and he was kind of insane. He was saying that he was going to let everyone know the difference between 'a condor and a girl getting raped'. Mom didn't stir and I thought that was weird. I thought about offering myself up because I wouldn't mind getting in bed with him, but then thought he might be violent/crazy etc. At one point he said he graduated here with comedy honours."
        }, 
        {
            "number": "3985", 
            "head": "2013-03-14 (22)", 
            "content": "I was at a shop or something. Trey Parker and Matt Stone were there, signing stuff. Someone had a Cartman plush toy and I had the same one. They made fun of my accent. Dad was elsewhere and I was waiting for him."
        }, 
        {
            "number": "3986", 
            "head": "2013-03-14 (22)", 
            "content": "I was on a beach and I was thinking about getting in the water, when there was a tidal wave. It started getting higher and higher and Ezra and I climbed up this big step thing. Waves kept coming higher each time, and we climbed up higher. Eventually it went right over us at the top step. I climbed down and ran to these steps attached to a building which were surrounded by glass. I realized I was trapped there, so I got down and tried to find a car. I found a golf buggy, but it was really slow. A girl was following me. I got off and there was a tent on some grass. There were two weird looking babies in there with big heads. An insane lady grabbed one and bit out its throat and started eating it. Blood went everywhere and I ran. The waves were finally over and I started looking for everyone I had been there with."
        }, 
        {
            "number": "3987", 
            "head": "2013-03-21 (22)", 
            "content": "I was part of an underground movement during World War 2 and the SS were looking for us. The leader guy was basically Hans Landa (Inglorious Basterds) (his personality was very similar), but looked different. He had a wide nose. Calvin was part of the group and we went into a house where there were lots of old people. It was well furnished and looked of the times. We saw him come through the door and we got on our knees and were crawling around trying to find a way out and avoid him. He found us though and took us outside. He told me to dig a grave in the snow for Calvin, who was now someone else. I was wearing a shirt and shorts and had no shoes on and I had to use my hands. It was very cold and I started scooping it. I was a few feet away from him and I chose a moment to start running away. He followed me, but walked. I never stopped running, and went through a field with lots of abandoned, ruined castle looking buildings. I ended up in a building which was full of stuff and had lots of shelves and I ducked in between them trying to find a way out. He followed me in there, still calmly walking down the middle of the building. I climbed up some shelves and boards to a door leading outside (but it was like the equivalent of a balcony). I climbed down a ladder down the side and ended up back in the room. Any exit I went through was a dead end or brought me back to the room. The guy said something like 'you really want to live', but was getting annoyed with me. He ended up cornering me and held a gun up to my head and I was saying 'please don't, I'll do anything' etc. He seemed to hesitate and I was hoping he would have some respect for my will to leave from having escaped him so long."
        }, 
        {
            "number": "3988", 
            "head": "2013-03-22 (22)", 
            "content": "I was staying at Nana's, though lots of other random people were too. Kieran was there. He was sitting on the lounge across from Dad. They were talking and I heard Dad call him Andrew. I was staying in a room down the hall. There were 4 single beds. I got in one to go to sleep, when 3 other girls came in and said they were sharing the room. They weren't ready to go to bed and were talking and messing about. I was annoyed."
        }, 
        {
            "number": "3989", 
            "head": "2013-03-26 (22)", 
            "content": "Dad still lived at the old house. I was staying over. Ezra and Roland were there too, along with Stephen Merchant. We were out the front. Roland said he could hear a noise from the woodshed and said that 'someone was in there', but we ignored him. Then we were out the back sitting at a table. Stephen wrote on a bit of paper and signed it Stephen MerchanT -- the S and T being significantly bigger, especially the T, and I said 'the T's almost as tall as him'. He laughed. Then we were out the front again and Steve said he heard something in the woodshed. Dad went to check it out and came back with a bruise on his face, saying 'he hit me'. Apparently there was a family of around 20 Chinese people living in there. There was a hole in the laundry window that they came in through. I went to look and saw a lady using the sink in the laundry. I screamed. I went to the living room and another one came out and put her hands on my face. Someone said it was some ritual and so I stood there, stiff, and she made me kneel, then she bowed and I bowed back and I was thinking 'I thought that was a Japanese thing', but just went along with it."
        }, 
        {
            "number": "3990", 
            "head": "2013-04-02 (22)", 
            "content": "I don't know why, but I was in bed and had a vibrator that was very penis like, and was giving it a blowjob. I was thinking it was not as bad as I expected. I put it under my bedside table and fell asleep. I woke up with stuff on my chair and desk that I assumed Mom put there while I was asleep. I was worried that she had seen it. Later, someone was asking sex questions and Mom and Darren answered one about 'most boring sex'; they had been trapped in a car on the freeway during a storm and got bored. Also, you could collect this alternative money, which I was thinking as being like EVE from BioShock and you could purchase upgrades with it. I had about 3000 and bought two things worth 1000 each and then thought I shouldn't have spent that much (most things were around 15-50)."
        }, 
        {
            "number": "3991", 
            "head": "2013-05-15 (22)", 
            "content": "This guy and I had some friends. I was going down a path at some point and Ezra and some others pretended they were zombies and then I was like 'you're slow', 'you can't touch the pavement' 'you can't climb' etc as we walked away from them. I climbed these ropes which were stretchy. One felt weak and it was really high so I got off. The some girl friend of ours went crazy and all these people were after us. The guy was now Leonard (The Big Bang Theory) and we ran. We ended up in this house with cats, kittens and this fat, hard cat in a wardrobe and I think they were sick. We got to this place and Leonard said we had to find this game called something like 'huku fuku hakka nad' and it was a GameBoy game. We found it and it had a picture of the Hulk on it. We had to assemble the player and win the game to defeat the bad guys. They attacked us and I ran into a small room with was like a safe room and emptied all the parts onto the floor. Leonard defeated them and then came to the room and I told him to get in and we assembled it together. It was a very tight fit. We finished assembling it and I tried to Google how to win the game but then they came again. They got us and I hid the game between my butt cheeks. Then it was some time later and we were in their community. At the beginning, Leonard had written a shorthand message to me but I couldn't read it. It kept expanding on a blackboard until it basically spelt out the entire plan before I understood. We pretended to fit in with them. They were a similar race to Macedonian and I pointed out that I was too. Someone asked if Leonard was my boyfriend and I hesitated wondering what the best response would be and then I said no, but she said 'so he is' and winked. I asked a security guy for a smoke and he gave me an extra butt and it made me choke and it tasted horrible and made my mouth dry."
        }, 
        {
            "number": "3992", 
            "head": "2013-05-21 (22)", 
            "content": "I was staying in a hostel thing. I opened my suitcase and a girl saw my stripey pink pants and made a comment and I said they're soft and she tried them on and agreed. Dad and Ezra had a fight at a museum and knocked over a zebra and lost 8 bones. I had some Turkish food for dinner and then ate back at the hostel. I had a diary protected by a key which also needed answers to questions. People were desperate to see it. I knew Ted (How I Met Your Mother) and was in love with him. At some point Lily said that she 'noticed how cute Ted was, and had to go home with my toothbrush for a bit'. We were lying on a bed and heard a hiss. There was a big yellow snake that he called an 'adder'. The girl said 'don't act scared', but I threw the blanket over us and we lifted it up and the snake climbed on her. I ran and she followed. It was night and I was outside in a park with a bus shelter. I ran down one side and she ran down the other. The snake ran down the path towards her but ate a lizard."
        }, 
        {
            "number": "3993", 
            "head": "2013-05-31 (22)", 
            "content": "I was somewhere where there was lots of water with various things to climb on. I got quite far and there was a congested tunnel. I waited for people to push through so I could go through myself. I heard people screaming and someone said there was a shark. We all hurriedly swam back and tried to climb on something. The first thing I found was too low down so kept going. The next thing I found was wobbly. I finally climbed on something and someone else was a bit lower. We saw a shark fin come and went towards the the person on the lower bit. The thing we were on lost balance and wobbled. It got distracted and I managed to find another bit to climb on. Then later I was in the car with Mom and I was telling her about it being a dream and it was a crocodile and she said 'and then it [did something] and something to do with Amelia' and I said 'yeah, how did you know' and she refused to answer but then finally said I talked in my sleep. People were making short films and I went to this place to watch one. We got into a 'cage' and then it was swinging and chucked us to the other side of the room (it was a ride). Ezra was there too and I laughed because he'd probably be freaking out. When it was done we left and I realized I'd forgotten my jacket which had my wallet and keys in it. I went back and had to run into the employee area to get back to it. They didn't mind. I bought a chocolate and it was £6. Later I was at a park. It was pretty and there was a huge water area which was green-ish. It was only like 1cm deep though. I was eating lunch. Sailing on the Seven Seas was playing on a radio and Mom and Darren said it was lame."
        }, 
        {
            "number": "3994", 
            "head": "2013-06-19 (22)", 
            "content": "I held a school reunion at the old house. Some people there were people who were strangers, but I'm not sure if I knew them in the dream or if they were strangers to me in the dream. Dmitri was there and looked really hot. Eugene and Bradley were also there. People were sleeping over too. I put a glass in the fridge and there was a countdown from five and it exploded. Dad yelled and said to never put a glass directly in the fridge. Later, I went to the toilet which was facing 90 degrees counter clockwise from where it does face and left the door pulled to. I peed and went to wipe, when Dmitri started talking to me and someone else came along as well. Later, this girl and I got into an argument and she was being bitchy to everyone. Her friend was also bitching with her. Everyone was then gone except those two, and she was still carrying on and I turned around and started yelling at her calling her a bitch. She got up angrily and I had this butcher knife and I hit her and her friend with it, and then ate them. I went out to Dad and said I ate them \"not in a weird sex way\" and he started helping clean up the evidence. They had been on a mattress with blankets and had left some spots of blood. I put the blankets in a basket. I put her suitcase and stuff together. Dad went out to do something. There was a knock on the door and some salesmen were there. They gave me a card and a paper bag and left smiling. The card said 'to Izzy' and then had some crap about donating to poor people. They returned not long after and I gave it back and said 'sorry, not interested'. They were bothered by this. The girl's phone on was the bed and kept vibrating because a friend was ringing. There was a voicemail from me, which I'd left earlier, of me yelling at her. I took the suitcase and a bag outside, and got a few houses down but then I saw people from the reunion across the street and the salesmen coming back, so I left it and went back. The salesmen had gone inside, but I couldn't find them. Then there were kids in the house demanding donations. I was thinking this was ridiculous and that we weren't going to get away with this at all now. Then it changed to a father and young son. He had 'made' friends, but they had died. Then they were escaping from something, and the kid got new friends and a dog (all created) and then they walked away happily."
        }, 
        {
            "number": "3995", 
            "head": "2013-06-27 (22)", 
            "content": "I was with The Doctor (David Tennant) and we ended up at this place where there were these mini volcanoes in barrels over the water. We had to win to prevent the volcanoes going in the ocean, which would be even more dangerous. We needed 11 and we had 11, but still had to answer questions. There was a buzzer sound and The Doctor pointed out that it was \"from Pointless\" at the same time. They asked what most people said came after 'Twinkies'. I said roll, because I couldn't remember what they were and she looked at me in confusion and said 'no'. A black guy called Nate asked me out and I agreed and then changed my Facebook status to 'in a relationship' and then I was like 'I don't even like this guy' and cancelled it and unfriended him. I was with Benjamin later and we were either dating or just flirty."
        }, 
        {
            "number": "3996", 
            "head": "2013-06-29 (22)", 
            "content": "I was at a shop (it was big; smaller than Westfield, but it had more floors) and then I left and went to find a car. I couldn't remember where I had parked. Then it was like a game and zombies suddenly appeared. They were weird and green and slow. Then I was in a pub. Lots of celebs were there. Martin Scorsese was one of them. The guy behind the bar made a joke to me but I couldn't remember who he was. I saw Nathan Fillion and I said 'ooh, can I get a photo' and he was like sure and really chilled about it. He put his arm around me, tightly, and I took a phot, but he was out of shot. I went to find someone else to take the photo. It took a while to find someone else and Dmitri was dancing to the music. After they took the photo, this girl was like \"I LOVE him\". Then I turned to see Alexander Skarsgard with 'nerd Eric' hair and I asked for a photo too and then I woke up."
        }, 
        {
            "number": "3997", 
            "head": "2013-07-24 (22)", 
            "content": "I was at The Janitor's (Scrubs) house, and there was like a party but in this shop area. He collected old books/art and fixed them up. He kept offline records of things people bought/what he spent (he also owned this shop thing) and noticed he was spending too much and he announced to everyone that he was quitting his job of being a janitor and doing something else instead. Then there was like an explosion and a panic in the streets. People were trying to get in and we tried to keep the doors shut. Then we either got on a train, or it just changed to being on a train [note: I watched Snowpiercer recently], which was owned by The Janitor. There were a few other friends/acquaintances on there. There were about 8 carriages and they were separated by sliding doors. Each carriage also had a door to the outside which was open and zombies were climbing in; even though the train was going very fast. The Janitor knew of a way to shut the doors so they wouldn't open from outside. There was an emergency latch to the right of every door and we had to pull it towards us. There were 5 of us and I said that 3 of us would go through and start clearing out/closing the carriages and told one to stay behind and the other to trail us. It was mostly easy and then there was a whole bunch in the next carriage. A guy was standing right at the door and we told him to move because there were lots of zombies and he was being cocky and then it opened and they surrounded him. He got out, but I think he was bitten (or maybe just scratched). We only had these guns which shot arrows and they had a slight reload time. We were shooting them in the head, and had good aim. We cleared the carriage and kept moving. The carriage at the end had humans in it -- a teacher and children. We saw them climbing in. I yelled 'get off our train' but then a female 'friend' of ours was with me and opened the vent and said that they needed to close and secure the door. She somehow got in there and started doing it and then something pulled her up through the vent. I was like 'holy feck' and then a dog came in and it started attacking the group, but then I saw it coming towards me and I ran. It was getting through these holes below/above the doors. I got to the first carriage, where everyone was armed and waiting up high. I climbed up and waited with them."
        }, 
        {
            "number": "3998", 
            "head": "2013-08-07 (22)", 
            "content": "Our IMDb film credits were up. There were lots of associate producers. Benjamin's last name was 'Demon' and listed above me so I was annoyed. There was also a guy called Philippe."
        }, 
        {
            "number": "3999", 
            "head": "2013-08-07 (22)", 
            "content": "There was a new movie with Simon Pegg and Nick Frost. Frost's last name was also Pegg (which wasn't 'real' but was like a nickname that had happened before they met). It involved time travel. When Frost was a kid he had a toy called 'Pegg' and it was something that he liked and that was how he got the name. Pegg went back in time to stop it and see what happened but he died and then it showed Frost as an adult 'die' and Pegg was upset and crying and everyone was saying it was like the most depressing movie ever."
        }, 
        {
            "number": "4000", 
            "head": "2013-08-10 (22)", 
            "content": "Benjamin came to London and we met up the same day. I was talking to him with no issues and was like yay it's finally working out. Then out of nowhere, he had a girlfriend who was American. She was blonde and wore lots of makeup. I didn't like her at all. I put up with her, but when she came and they went to kiss, I just walked on ahead and didn't look back. Then they started getting really into the PDA and I just walked off. We were in a shop or something. Benjamin dissed me for playing Pokemon at some point and I said it was only because he hadn't played it. There was a weird thing with ropes and you had to climb to get to different shops and displays. I did that for a while and then checked my forum messages. Benjamin sent me one saying his girlfriend had broken up with him saying that it was my fault and she had sent me a message saying the same thing and said 'yes, you guys might be perfect for each other and you might always be interesting to him and he'll never be bored, but blah blah'. I messaged him saying I never said anything to her and I thought she was a 'personality-less bore' but was perfectly polite. I thought he'd chuck a spaz over that, but he didn't. He didn't seem too upset."
        }, 
        {
            "number": "4001", 
            "head": "2013-08-10 (22)", 
            "content": "Lydia posted a status on Facebook saying she got in trouble for having lesbian porn and videos of her and her girlfriend having sex on a USB. I thought it was TMI. I was watching Supernatural and Dean's girlfriend was crying at him. It was an emotional scene and she had to sacrifice herself for something. She had to become a vampire. It turned to day and she was burning and threw herself in a fountain, falling a few levels to the bottom. I don't know what she had to do but then I was there too. People were coming in and we went outside and she wasn't a vampire anymore and hid behind a statue. I climbed up to the roof to lie on this thing sticking out, but it wasn't hidden enough so I climbed over a fence and went out the front again. Then I was at some performance thing. I was sitting with people from school at a cafeteria. Lydia was there and had found out I like Eugene and she had pretty much told everyone and I was avoiding him. Then I was with Benjamin and we went to the performance. We were sitting together at the end of a row. Colin Mochrie was in the row next to us and there were some other famous people. Some people from FilmForum were there too. SuperGuy was behind us -- he had dreadlocks and gold teeth and looked sort of like an early 20s drop-out addict -- then someone was next to him and then FlyingSquirrel was supposed to be sitting at the end, but a girl was there. She got up and then FlyingSquirrel came back and he was kind of hot. Benjamin was pointing out some of the others, as well as Local and Gunnar. People got umbrellas out and I wondered why there were umbrellas and then I saw the show on the screen with umbrellas and water came from the ceiling. I was wearing my orange beanie and I laughed and Benjamin ducked under another umbrella."
        }, 
        {
            "number": "4002", 
            "head": "2013-08-18 (22)", 
            "content": "Stephen Merchant married Rose Byrne and I was peed off about it. There were pictures of them kissing and moving in together. They hadn't been dating very long and Stephen had asked her and she said yes. I was thinking 'I knew I hated her for a reason!'."
        }, 
        {
            "number": "4003", 
            "head": "2013-08-31 (22)", 
            "content": "I was at this like 'camp' and we had a hotel thing, but it was in the middle of a village and it was run by the same people. I think I had bought the McDonald's? Except it was like a supermarket and I owned like half of it/invested in it or something. We had to line up and we were at the end of the last queue and I said \"I thought it would be a good idea to invest in McDonald's, because you know it's not going anywhere\" and joking about having to line up. There was something weird going on there, like people were going missing. I was with Dan Palmer, and we were investigating. We went into one building where we thought the dodgy stuff was going on. I can't remember why, but there ended up being a lot of severed fingers [reference to Stalled] - I think there was a 'rite of passage' and people were turning into something else and part of this was having their fingers severed. We managed to escape from there and went back to the hotel. One lady kept going on about needing lights in the bottom row of the store and continued going on about it even at the hotel. We went back to our room, which was next to their room. Dan got into bed and I reached over him to reach something and he grabbed me and I laughed and jumped back. I got onto the bed and leaned over and started kissing him. I went on top of him and I felt him get hard. We took our pants off and started having sex. I heard some noises and could see shadows of people behind the door and I tried to tell him, but he waved it off and we continued. I woke up part way through."
        }, 
        {
            "number": "4004", 
            "head": "2013-09-05 (22)", 
            "content": "I had this box thing and the only way to open it was using high temperatures. I was running and then I jumped into the water. There were all these danger/warning signs because it was hot there. I started swimming to the cooler side and stopped when it was tolerable. A friend or something came to help me and then I died. Then it was 2 years later and I was like a ghost. Apparently what I'd done had something to do with work and Howard wasn't letting me out of the contract. I complained to someone that I'd died and he was still keeping me here and he heard and I went invisible and walked away as he started yelling at me. It was Independence Day and I realised I'd forgotten and had also forgotten my birthday the day before. I was at an office building which had a weird elevator with multiple sections. I ordered a water from a little booth thing."
        }, 
        {
            "number": "4005", 
            "head": "2013-09-06 (22)", 
            "content": "I had another job that I went to two times a week. There was a small platform for the tube with only one carriage door. It was always late. I got to the place where the office was and Howard was there and said 'you're here early' or something and was wearing his Pink Floyd shirt and I said 'I have the day off' and he said that he had a 'job interview for the first time in years' and he walked into McDonald's and I went up the escalator. I went to eat and asked for this salad but the lady said I should get the chicken because it's healthier and it was like £9.80, but I said ok. I ate it quickly and then ran to the office and was like 15 minutes late. I signed in and someone asked me when I got there and they said 'you should've been here early, you missed [some amusing incident]'. I said the tube was always late and he said that he knew. It was a place where they made all these inventions. One was a scent detecting lock. Another had a cupboard that looked like it had shadows on it, but it opened to nothing except shadows (I think it had something to do with invisibility). I sat at my desk. Each desk had a curtain that could be pulled 3/4 the way around. I had a pink rabbit vibrator in my drawer and I put it in my bag to take away. I got up for a bit and later it was gone, as well as some other stuff. Someone had put a bunch of stuff in a fridge/freeze and it was in there. I quickly took it before anyone saw. There were also a few other things in there. The girl that had done it was sleeping and I wondered if she had been sleepwalking."
        }, 
        {
            "number": "4006", 
            "head": "2013-09-15 (22)", 
            "content": "Had a text from Kiersten saying 'hey chic' and said Beatrix had said I was really noisy after 11pm. I also got a message from Benjamin saying something like 'I should've told you by now but I'm still a virgin'. I thought it was an odd comment but I was glad that he was and wondered if he'd told me because of that."
        }, 
        {
            "number": "4007", 
            "head": "2013-09-19 (22)", 
            "content": "I went to a second 'FrightFest'. I had a full pass but it was a different image. There were not as many films and didn't go for as many days. I was seeing Stalled again. The cinemas weren't enclosed and it was like a screen, some chairs and then two rows of chairs right at the back. I saw Dan Palmer and some other people involved there. There was a girl second from the end in the first row and I sat next to her, but didn't sit entirely on the chair. I asked if someone was sitting there and she said no and she seemed friendly. I got comfortable. Something was playing on the screen but it was like trailers and interviews. Something happened and Dan got on a bike and was chasing after someone. I had something and he took it off me and I was squeeing inside and Christian James and the girl started recording it -- he recorded with his phone and she recorded with her iPad. A fat guy was there too. Somehow I got involved with the short film and then it was edited and done. We missed the film though. Dan was walking up to me and I was getting nervous and excited. He was just chatting to me about stuff. They also got my name for the credits of the short and I was excited about getting something else on IMDb and being right under Dan's name on the short."
        }, 
        {
            "number": "4008", 
            "head": "2013-09-23 (22)", 
            "content": "I went to this place with a group on a tour thing. There were footprints in the wall that were massive but were David Bowie's. There were hands of celebrities as part of the decor as well. I went to the place where they were filming Stalled except it was like a classroom. They set us up so we were sitting along the wall. I was looking for Dan Palmer. Somehow later, I was talking to a lady about a project and she said yes and then I went to a place and opened the door and went in and Dan Palmer and Christian James were there. I said 'she said yes' and we all sighed with relief and it was a producer for a film/TV show we were doing together. The place was empty and square with a rectangular shaped kitchen to the side. Christian James got a blanket thing and folded it up in a corner like a bed, then got this sheet and stretched it over the kitchen. I wanted a bean bag for the corner."
        }, 
        {
            "number": "4009", 
            "head": "2013-09-24 (22)", 
            "content": "Bullfrog was my boss. He had recently taken over my work (which I think was a supermarket). He was really tall and slim and bald and spoke perfect English with an English accent. He was always mean to me and had cut down my hours so I was barely working. There was a poll about who the killer in Friday the 13th was and 60% of people had voted for Jason Voorhees and I complained because it was his mother and Bullfrog started attacking me for some reason. I fell down some stairs and was lying on my back. I was shouting at Bullfrog and he stabbed another guy. As he was pulling out the knife I was like 'just do it!' and he stabbed me and chopped my head off."
        }, 
        {
            "number": "4010", 
            "head": "2013-09-25 (22)", 
            "content": "I found a short film that Dan Palmer did. It kept becoming real life though and Co-Worker-F-06 was in it and she was with her boyfriend. We were using this room, playing music which was The National. I was playing GTA V on the TV. There was a pool just outside. Some other people came and looked like they were going to turn the music off and I said \"don't even think of turning the music off\" and this black guy looked at me like 'whatever' but I just stared angrily and his face softened. They didn't do anything. Co-Worker-F-06 stripped down and went for a swim. Later, she was talking to some guy with her boyfriend and he asked her who he was and she said 'my brother' and he was like 'what'. It was her breaking up with him. Later I was going back to somewhere and went in and there were zombies everywhere. Then it was back to it being a short and it had been a really tense kind of build-up and you wanted to know how it ended and then it just turned to zombies. I really liked it and gave it an 8/10 and favourited it on FilmForum. Jordy had watched it ages ago and had posted a positive review. The short had been made years ago but was only recently added to IMDb. I was thinking that those guys really loved their zombies. There was also a glimpse of Stalled at the end and Dan Palmer looked really hot and I was excited about Stalled. Also at some point I was on the Eiffel Tower and you had to win tickets from games to get higher. I got a burger and it took me 2 hours to eat it. When I realised how long it'd been I wondered how it was still warm. People kept talking to me and annoying me."
        }, 
        {
            "number": "4011", 
            "head": "2013-10-01 (22)", 
            "content": "Dan Palmer joined the forum. His username was Dan Palmer. He posted on the Welcome thread with a nice little introduction and said his birthday was 7 Jan 1978? Maybe the 9th. Anyway, he posted on a few threads and I was worried about him seeing my posts about him. Benjamin sent me a message on Skype saying like 'he sounds like you' because he'd said 'I'm awesome' and similar stuff in his intro."
        }, 
        {
            "number": "4012", 
            "head": "2013-10-02 (22)", 
            "content": "There were zombies. I don't really remember what it was like but we'd had some massive fight against them where we felt like we were safe and went to sleep. We were in this big building which didn't really make any logical sense, because sometimes it was like a massive mansion or an office or a mall. I woke up and heard people. I looked outside and saw normal people just doing normal stuff. I went to find my friends. I looked in a room and saw a hand lying on the floor from behind a desk. I went in and Hank (Breaking Bad) was lying under there sleeping. I shook him and he said like 'that was the best sleep ever' and I nodded and grinned and then said 'there are people outside'. I opened the curtains and outside were tons of people coming into the building. It was like there were no zombies/nothing had happened. He went to find his mate by opening the drawers of the desk. He wasn't in there. Two cupboards were at other side of room. I opened a drawer and he was sleeping in there - it was Simon Pegg. He jumped out and we explained and went to investigate. Outside the room it was now a mall, and tons of people were coming our way. I was doing like karate poses when they came near but realised they weren't zombies. People were running shops etc. We went to one shop and Silas was yelling at the lady about a 'doll rack' in the back and she was like 'how do you know about the doll rack' and I said exasperated 'someone told us about it, please would you just check if it's there' and she went and checked and said yes. I didn't know what the relevance was. Then there was something about a 'vampire' thing and there was a container of these like bottle holders, but they were squishy and had like bubble wrap on the inside. One had fangs on it. They were like £53 pounds or something though because it was some charity thing. I wasn't sure if that's what we needed but I was like 'too bad it's so expensive'. Someone said that centuries had passed after the zombie invasion had died down but I didn't think that was right because no-one was acting like a zombie invasion had happened."
        }, 
        {
            "number": "4013", 
            "head": "2013-10-15 (22)", 
            "content": "I was at a table in a restaurant (like a big one, ball room type of thing). It was a place where some play or something was going on. The other people at the table were the actors in it.  I think I was friends with one of the actresses. Then I was at home and I lived with Dan Palmer and we had a son who was about 5. We were in bed and I was waking up. I was on my back and he had his arm over me, sleeping. It was our son's birthday or something and we were in his bedroom and Dan was joking around as you would with a kid and then gave him a Caramello Koala from behind his back which was apparently his favourite chocolate. And I continued joking around like 'gasp, he doesn't like Caramello Koala's' and then I pulled another one out from behind my back. The kid was really happy about it. Also the Caramello Koala's were more like small Easter bunny chocolates with just tons of caramel in them. Then these 'officer' types came and demanded to look inside and we let them. They looked for 'illegal' animals, like you needed permission for all the animals on your property and I was like 'what if a random animal just wanders in', but apparently that was ok. I looked out the window and there was this bizarre lizard creature, it was like two animals together; one was this lizard thing and the other was brown and had a long neck and a sort of ET looking face. The lizard had an iguana-ish face and would drape itself over the brown thing and it would like carry it along. I said 'we don't own THAT' and they were like 'yeah we know'. Then there was this species of chicken which was pretty but dumb. They gathered us all in the backyard (which was massive and there were a bunch of other people but I don't know who they were). They tossed forks in front of the normal chickens which picked them up and the stupid chicken just started running around like a fool. They wanted the other chickens to attack it, and they started chasing it around. I was like 'I don't want to watch this' and gathered my son and Dan and we went and placed ourselves in a position to not see it. Another lady had done the same with her son and on the way to the place to sit she looked at us in disgust and was like 'I'm not subjecting my son to this' but I was too sad to have a go at her. I had the feeling that the son was confused and not bothered about the whole thing and I was thinking 'I hope he doesn't end up a serial killer'."
        }, 
        {
            "number": "4014", 
            "head": "2013-10-16 (22)", 
            "content": "I somehow ended up in one of those crop plane things with someone else. Either he or I was the only one who knew how to land it. We were messing around for a while when it started getting really windy, so we put it down. In the distance there was a bunch of smoke. We landed on a strip that was near this like cabin thing (like in horror films when they stop in at a petrol station or something in the middle of nowhere, it was that kind of look). There was just sand everywhere too, no roads nearby. It was dead quiet and there was no-one around. The guy was now Dan Palmer and we were suspicious, so hid behind this thing in the middle of the path leading up to the cabin thing. There was another building to the right and I saw a zombie stumble out from behind it. It started coming towards us and we moved around the thing we were hiding behind and as it came near I think I wrapped my arm around it and broke its neck. Another zombie from near the cabin saw us and started coming towards us and I did the same thing. We moved closer and Dan was peeking out and I said 'stop, don't move' because this big green monster (which I referred to as The Hulk) was lurking behind the cabin/near a tree. It was just a little taller than the cabin and was slim-ish, not like a massive thing like Hulk. It saw him anyway and I think it just left. I can't remember what the deal was but I had to chop off someone's hand and I chopped off their right hand and there was lots of blood; it was quite graphic. Then I had to chop off Dan's hand and he said to get rid of the left one and I found an axe and started chopping it. There was lots of blood and it was fairly easy to cut through although it took a few hits. I also chopped off some zombie's head with the axe. Then I was at some like beachside town and there were jetties and whatnot and stuff decorated for Halloween. I saw some kids wearing costumes and I realised it was Halloween. It was dusk and I was on my way home and I thought I might come back down to check out the festivities, but needed to get some movies watched for challenge first."
        }, 
        {
            "number": "4015", 
            "head": "2013-11-05 (22)", 
            "content": "I went to see The Lords of Salem which was actually a live show. Rob Zombie was hosting but he didn't look like him and he also had a Northern accent and mentioned he was from Yorkshire. The show was held outside in a field thing. There was a big stage. I can't remember what happened at all, but it was pretty fun. There were lots of lights and stuff. Then it was inside. There were lots of kids in the show. Something weird was happening and they were taking people? I either went on stage or was talking to Zombie and he took my wallet? I went to leave coz I thought they were going to take me and I went out the exit and then realised he had my wallet. I went back in and wondered how I was going to get it. I was with the kids and they seemed to think something was going on too. A lady came and said they were looking for Eleanor or something similar to that, which was a codename thing. I said confidently, 'It's me,' even though I knew it meant they were going to take me (it was to save the kids??). She said to follow her and we got to the edge of the stairs at the stage and she said they'd be a while and asked if I wanted to sit. So I did. I also needed to pee. I was trying to work out how to make a run for it, when I realised they weren't even guarding me or whatever, so I walked out. I started running for the tube station (it was night) and the lady came running after me. I think I tripped over or ran into something and they caught me. They took me to this place and made me stay outside. It was fenced off and guarded by this one dude. The lady, who was now Jeb, told him to not let me through. I was crying and saying let me out and he started crying but wouldn't budge and said he had to follow orders. The only thing outside was one of those small rectangle plastic bin things, so I grabbed that to use as a pillow and curled up, trying to sleep. Then the guard was talking to another guy, so I got up and slipped out and he gave me a look like he'd done it on purpose. I ran, and they didn't follow. I got to the tube station and you had to scan the Oyster card and then your ID. Another guy was having problems with it, but it finally worked. I did mine but my ID said 'CONNED', and I realised they tricked me with a new licence thing. I had another one in a pocket, so I used that. I ran to the elevator and a fat guy was behind me so I tried to keep it open but he just stood there, so I went in. I ran to the first train I saw but I didn't recognise the next stop and realised I had taken the wrong line (a lady said it was the \"Green\" line). I got out and tried to work out where to go. It was like 1.30am so I wondered why the tube was even running."
        }, 
        {
            "number": "4016", 
            "head": "2013-11-07 (22)", 
            "content": "I was watching How I Met Your Mother. Lily and Marshall were getting a divorce or something and she and Ted decided to give it a go. Ted had inherited the 'property' of something and had this small, but nice, house in a quiet street. It then cut to him and Lily lying in bed after 3 days. He was right next to the wall and obviously not interested in her. She complained they had nothing in common. She stormed out of house and he followed and then was shown whispering to Marshall who was waiting outside. It was a set-up so she'd go back to Marshall. He caught up with her and they seemed happy to see each other. Then I was there and there was a car waiting. As they were coming back he said 'run', and I struggled to lock the door and then ran. The doors were open and he got in the left side and I got in the right (though the car was facing us). We were driving for a while and then The Mother was in the front. She was wearing a white, fitted dress with white heels. She got up to change stations and had to bend over and Ted perved on her. She turned to us and saw what I was wearing and went off, like 'what the hell are you wearing?', 'you need to change' etc and I yelled back saying 'I'm wearing what I'm comfortable in and I am comfortable. You're dressed like you're modelling or going to a ball, I don't need to dress for attention every second of my life' or something. I realised I hadn't put my shoes on and we pulled into a shop to get some. They seemed to be out of clothes everywhere. The Mother dissed my clothes again and I was like 'I'm just wearing jeans' and saw I had a hole, then saw they'd been like slashed across the front and back of the knee and at the bottom. I was like wtf and accused The Mother. She didn't deny it but I didn't know if it was actually her. I was looking for jeans too. Ted seemed to be getting annoyed and I was annoyed and worried that he was going to ditch me for her. She ended up buying me this little fish. She gave me the bag and I saw the fish (it was red and white) but then it was gone. I couldn't find it and she took it back and there was also a Korean family staring at the fish and we assumed they were going to eat them. The Mother went to this old lady and came back with my pants 'fixed' - the lady chose between 'bringing the fish back' or fixing my pants. I was annoyed but like I didn't need a fish and I was going to get new pants anyway."
        }, 
        {
            "number": "4017", 
            "head": "2013-11-19 (22)", 
            "content": "I went back home to visit. Mom, Dad and Granma greeted me. I was friends with Dan Palmer and we were somewhere. I'm not even sure where we were, but it was inside. He had the Stalled hat on, and he was near me and I took it off and put it on."
        }, 
        {
            "number": "4018", 
            "head": "2013-11-23 (22)", 
            "content": "I went back home for a bit. It was hot and humid. The air-con wasn't really working. The cold air-con was the only thing helping. Home was different. Mom, Darren and Ezra were there. I said I'd have to stay in lounge and have a 'movie marathon' to keep cool. I decided to play games instead. I was telling Mom I'd have to go back soon because I couldn't handle the weather. Also there was a movie which kept changing to real life, where some weird stuff had happened and this lady was saying a spell calling 'Cloverfield' and then it showed this bridge and a giant foot step on it and start walking that way. We were going the other way through a tunnel. Clovie got there and it was actually a dinosaur and big, but not as big as Clovie. Then I was actually there and it roared at us and we ran and hid, but it found us and we continued running. Then I was at this house. A person gave me a key and said it was for the door in the kitchen -- there was a trapdoor in the ceiling. A clone of this girl was there. There was something to do with Lost."
        }, 
        {
            "number": "4019", 
            "head": "2013-11-27 (22)", 
            "content": "I was staying at a hotel thing with Granma and others, but I was sharing a room with her. I walked out at one point and then came back in and saw Simon Pegg leaving looking a bit dishevelled. I went to walk down some stairs and I saw Stephen Merchant. He was very tall. He was with a lady and picked her up and carried her down the stairs. I took pics and was excited about seeing him. I ran to the room and got the number wrong - went to 140 - and knocked and then quickly ran to 145 and knocked. A lady came out of 140 and looked around and went back in. I went into the room and it kept changing between Mom and Granma. I told her about the people I'd seen. I also saw Robert Webb at one point and there'd been some scandal video thing - someone told me that some actress had given him a blowjob, but I looked it up and it was actually him being forced to give another guy a blowjob. He started crying during it and I was like 'how is this porn, this is a torture video'. Then Mom had a room there and we could see into it. I had a flask thing that was steaming. Granma was like wtf and it was some illegal thing, so I tried to give a signal to Mom and she realised. Granma realised and called me like a traitor. I went on Facebook and was looking at photos of Dan Palmer and there was a comment by a girl called Christine Murray saying 'I'm his girlfriend' and my heart sank. I was looking at her photos and there were heaps of them together and also check-in's in London - at her place, I assumed. There was also this weird little frog and when I waved at it, it smiled excitedly and then jumped on me. It was then a frog-cat thing and I was wondering when it became possible for those to breed."
        }, 
        {
            "number": "4020", 
            "head": "2013-12-01 (22)", 
            "content": "I was on Facebook and someone had commented on a status saying something about me liking Dan Palmer, Kit Harington and Benjamin - but not quite so obviously and then Dad posted saying something like 'you like Dan Palmer, Kit Harington and Benjamin at the same time?' but had tagged Dan Palmer and had also said something about the number of people. I untagged Dan Palmer and it showed who had seen the post and he hadn't and I was like thank god. I went to add him to people who couldn't see the post but he didn't come up. I went to search for him and he didn't come up. I checked my friend count and it was 61 (one less) and I realised he must've deleted and blocked me and I assumed it was because of that and I was really annoyed."
        }, 
        {
            "number": "4021", 
            "head": "2013-12-05 (22)", 
            "content": "I was out with Benjamin at like a cinema, or a place where there was one cinema. He had found some film club which was like £100 a movie that he wanted to go to. One was on today -- it was Les Miserables. I was annoyed because I didn't want him doing it. We were in a building but just outside the cinema thing, eating at a table. He got up and was gone for ages and I went into the cinema to find him. I couldn't, so I went back out and he came back like what's up. I felt silly. We went to some cafeteria type place which had lots of tourists. They kept moving the tables and chairs around. I sat down and Benjamin was still standing and two girls started talking to him. One sat next to me and started talking. He asked where she was from and how long she'd been here. She said '2 weeks and for 6 weeks altogether'. I said I'd been here 6 months and she asked if I had a passport and I said yes and she was like 'oh you're lucky'. Eventually, Benjamin and I sat together somewhere. He signed his name with his right hand and I was like 'why are you using your right hand'. He looked at me incredulously and said he signed his name with his right hand, but it looked like he was embarrassed about being left handed? We were talking and joking etc. At some point we kissed but nothing seemed weird and we were walking around flirting and messing about. It was nice and I was happy."
        }, 
        {
            "number": "4022", 
            "head": "2013-12-13 (22)", 
            "content": "I was at a cinema or bar thing. I might've worked there? But maybe not working at the moment. A group of four guys came in and stood in front of me, looking nervous. They had hats/sunnies on. I recognised them - one was Bradley Cooper, and the other three were famous friends of his. I waved and joked about them looking dodgy (though it was something witty). I chatted to them and said there was a little booth thing away from everyone else and showed them where. They started messing about in there. It was dark, but I tried to get a sneaky pic. Bradley Cooper got peed off at some point and stormed out. Someone suggested it was because I took a pic, but I showed them my phone which was on the forum and said I hadn't (they believed me - though I actually hadn't managed to get a pic). On the way out, I saw Richard Ayoade and a bunch of people said his name in this weird way as some kind of in-joke. I went outside. A lady was walking around and one side of her face looked weird, like she had a really sagging eye. Someone called out 'Deborah [something]' and she was an actress who had been in low-budget horror films, one was a cult favourite that I hadn't seen but had heard of. She was still young though. Someone asked if it was her and I said something about Dan Palmer having said something about her. Then Dan Palmer was there but I didn't recognise him at first because he was dressed up like a goth/tranny? It wasn't until he started talking that I realised it was him (the 'r' impediment). Also, I got a text from Kiersten saying the room had been booked and was really nice (we staying somewhere overnight/couple nights). There was one big bed and then on the other side of the room there were two smaller, but slightly bigger than single, beds. Lukas also text me about it."
        }, 
        {
            "number": "4023", 
            "head": "2013-12-14 (22)", 
            "content": "I lived in a weird house with Julian Barratt and two others (one was a girl, but I can't remember the other one). I had a huge crush on Julian and everyone knew (including him), but he didn't seem to be interested. There were also these people who sat outside my window all the time, two were dressed in animal costumes (a cat and a fox?). They creeped me out and I always kept my curtains pulled to, but each window had its own curtain and it didn't fill the entire window. Mostly I just ignored them. My room was big and had two single beds over each side (one next to the windows and the other one next to wall, where door was). One day something happened and we had sex, but I think he was forced into it? We didn't speak about it and kept on as usual. Two of these people were girls, one who did stuff for me and one who was nice and perky, but she kept flirting with Julian. One day I got sick of it and I told the other girl to get rid of her. Then these chimes kept going all night, so I had to take them down and put them away. I also talked to the people outside once and asked why they were here. They said to monitor the relationship with Julian? The guy in the fox suit was called Tom. I went out and walked down street and hadn't really paid attention to what was around before. There was this big gelato shop with weird flavours and stuff was around £2.50-3.00. Some blue ice-cream, other weird colours and flavours. Nothing really interested me though, so I left. Back home, Julian was complaining to one of the girl's about something and I walked in and was like what and he was like 'I NEED TO FUCK' and he seemed frustrated and annoyed. I was thinking like 'dude, I'm right here and up for it'. He then seemed to realise and started motioning for me to go into my room."
        }, 
        {
            "number": "4024", 
            "head": "2014-01-16 (22)", 
            "content": "I was with Ezra and someone. We were in a car and Mom was driving. I was in the front. I was doing some project where we had to ask people for stories and determine the theme. We knew Michael Fassbender somehow. We pulled up at a house and Ezra asked him for a story and he started telling one but it sounded weird and Mom picked up that it was a joke or film or something. I was then like 'oh no, it has to be about balance'. They all went back to the car and I was still inside with Fassbender. He asked me a few things about the project. My question was to either write about a western or a Yoshida film (it wasn't the actual Yoshida, though I went on Skype later and was like 'guess who I have to write about?'). I walked back to the car and went around to the passenger side and Fassbender went to the other side and I asked if he wanted to sit in the front and Ezra said 'yeah' and I said 'I'm not talking to you', but Fassbender was fine being in the back."
        }, 
        {
            "number": "4025", 
            "head": "2014-01-17 (22)", 
            "content": "I was on Skype with Benjamin and he changed his profile picture to one of him which he had taken with his laptop and at a low angle, with a weird smirk on his face and looked a bit different. Behind him was a cupboard/shelf thing with a few bits and pieces on it -- one of them was a trophy of a hand giving the finger. Later, the picture changed to a video in real time and I clicked on it trying to work out what was happening and it tried to video call him and I cancelled it. Then it changed to this film he had been in. It was set in older times with farmers. He was in those ratty farmer type clothes [Hobbit-like] and he was lying on the grass with one of those wheat things in his mouth talking about how great the day had been. There was a girl lying next to him. Then it was real life, but it was in the present and I was there. He was talking to these two girls and I kind of walked off, but he re-joined me. It was night. We walked for a bit and then I was suddenly in this long dark hall at the door. Benjamin was outside on the porch and knocked. I looked out this little slot in the side but saw there were these two ghosts. They were cartoonish but had armour and swords. He was fighting them off and I was too scared to let him in. I saw this furnace in the door and switched it on and they melted. I let him in, but it was pitch black inside and spooky. I found the light and then we went into this room and there were computers and computer parts everywhere, as well as books. At some point, I realised it was a dream and was looking at this shelf of books and noted how similar they all were -- they also all had the same title, but I've forgotten what it was."
        }, 
        {
            "number": "4026", 
            "head": "2014-01-19 (22)", 
            "content": "I was a hobbit? I was with some other hobbits or whatever and we were at the place they meet Bard in The Hobbit: An Unexpected Journey. The boat was there and we went into the water and hid behind a ledge, but when he came he saw them and started swimming out to them. I stayed hidden and when he came past, I grabbed him. He was heavy and bigger than me so I had trouble and kept falling underwater. There was an underwater tunnel that the others went through and I pulled him through with me. Somehow he realised I wasn't going to hurt him but he was still cautious. We were in this underground little house thing. I was sitting with him in a bath (both clothed) explaining that we needed him to help us and he agreed to help. We left and walked up this big ledge thing and had to jump to the other side. One guy did and missed and fell but was ok, even though it was high. I grabbed the ledge and pulled it down and landed on the ground and flung back up. It was then a game which was like an advert I'd seen on TV that was set on a beach. One side had this pecking bird thing and has three holes where some animal thing would pop its head out and you would hit it. The other side had a cat which would hit them with its paw. It said you could win money, though I figured it would be like 'you win this much if you sign up with this site and pay money'. I did it anyway and it said I won over £100 (I had a bunch of them to hit, maybe eight, and each one said the amount I earned; I saw £30 for a few of them. I opened the thing to get my prize and it was all coins. I was with another person trying to work out how to carry the money -- we put it in a bag, which we put into another bag."
        }, 
        {
            "number": "4027", 
            "head": "2014-01-19 (22)", 
            "content": "John Cusack and I were in some group of thieves or something. Catherine Zeta Jones was also part of our group. Cusack was supposed to grab like $78 million for us, but he took it and ran. Sometimes it changed into a movie and there was a scene of him driving down a road in a car at full speed and then leaping into another one, with the old car crashing. We caught up with him at this place. We searched everywhere for him but couldn't find him. Finally we were at the last place to look. There were two playgrounds, but they were like houses. He wasn't there. The guy that was in charge was getting angry. In the smaller playground, we found Cusack's 'wallet', and the guy got excited and thought he found cash but it was just cut outs of puzzles from newspapers. I saw a ladder leading up to a window in the house next door. I wanted to wait until the others left before going up, but they seemed determined to stay and search the place. It got later and I heard old video game noises (pew pew pew) coming from the room. I gave the impression I was leaving and went behind this thing and then climbed up the ladder into this boy's room. He asked if I was looking for the other person that had climbed through and I said yes and he said he was in the basement under the bed and was bleeding. I lifted the carpet up and slid under it and went under the bed to find him. But then it was just under this bed and he said hi. A younger kid came in and said \"What are the shadows doing? I can't sleep\" and we tried to be quiet. He asked if the others knew he was there and I said no. I saw blood under him. There were pads and I opened one and he said they were noisy and I tried putting it on the cut but realised I had it around the wrong way. Then I heard a noise like people climbing through a window. We were now downstairs under a bed. He jumped up and walked to the front door. He looked out the window and saw them. It was now night. He got ready to open the door and we ran out -- it was now day. They shot at us and we ran for this van thing. I yelled asking how to get in and he said 'the window' and I shouted 'which window?'. I smashed one and tried to jump in (it was in slo-mo) but my boobs were too big to fit in, so I unlocked the lock and got in. He drove off. I was bleeding from the broken glass. Then it was raining and I was washing away some of the blood. He said 'you're not going to die, are you?' half joking and I said I was fine."
        }, 
        {
            "number": "4028", 
            "head": "2014-01-22 (22)", 
            "content": "I was on PirateBay but it was the freeway. There was a guy advertising his game, not a torrent, but for like $6. I watched a trailer and it was a racing game so I wasn't interested, but then I saw it had Diddy Kong Racing characters, so I bought it. There was a bit where you race these hovercraft things over water and then a giant lizard tries to get you (the 'boss' was called Swamp Thing 2). At the start of the game you are in a room with shelves and empty boxes. The game was all happening in real life. The lizard attacked and the controls were weird. I killed it and then nudged it, but it was just sleeping. Then I had to tiptoe through a room full of dogs and cats sleeping. I got outside and a kitten came up to me. It looked sick so I was careful patting it. I talked to Layla and she said she had played it and it was hard. I was messing around with the settings and then Mom came running out in a towel saying 'you're up?' and ran into this dark building/room which was a bathroom, and threw her towel off and ran into the darkness. Then it was real life and I was near a store which was called Svengen. There were mailboxes and I'd left some Maltesers in one. I went up to it and it was number 361. A guy was opening 360. I pulled out the Maltesers and he handed me a $5 note and I went 'huh?' and he smoothly put it into his box and said 'what, I'm just putting $5 into my box'. I said ok and left. Julian Barratt was my boyfriend and I went up to him and he said it was probably a drug deal and said to be careful (to 'act natural' because the guy looked dangerous). We had an arm around each other and we were talking and giggling and he kissed me a few times. The guy was nearby and I felt uncomfortable. We went into the store and walked to the other side and then heard it was getting held up. A guy was talking about how he'd rape some woman 'even though she was Native' and I was worried they would rape me, so I ran to this door and ran out. I ran down one way but then back tracked and snuck past. I had no pants on. Julian was still in there and slowly edging towards the door and I wondered why I left him. I was walking past the first road I'd been on so I didn't walk past the front of the store and get the guy's attention. I saw a bunch of people run out of the store and realised they were free. They kept running though. It was getting dark (dusk-ish). A cute, but odd-looking, guy was walking down the street. He stared at me with a grin and came over to me. I started panicking but then I saw Julian at the end of the street and he ran towards me and the guy left. We hugged and I apologised for leaving. Then I was at home which was like the old house. It was dark and apparently a murderer was around. I found Mom's head and a brain in the microwave. I assumed it was fake and was looking for a trickster. I found Ezra and I told him and he looked at them and the microwave was on and he stopped it and implied there was a murderer around and that they were real. I freaked out and grabbed a knife from the kitchen. There was something to do with a horror film which was fairly popular and well-known within the horror crowd. It was playing on TV. Ezra cut out some carpet and found a hole full of horror movie posters selling for £70. We weren't really talking because Ezra said the killer was probably around. We got split up and I text him saying we should meet somewhere to talk. I got a text later from 'Lukas' saying we should meet at Svengen, 'it's where everyone used to meet before Facebook' and I was like wtf. Then I had another text from an unknown number about something related, but different. I assumed this meant either Ezra was the killer or the killer was taunting me by having many people's phones (having killed them). I was hiding in my room and all the lights were off now and it was very dim. The door kept getting gently pushed open. I was really scared and started crying. I got the knife ready and the next time it happened I stabbed them and got them. They started crying out and it was Ezra. I opened the door and he'd gone into Dad's room and was sitting on the bed. I kept stabbing him and he kept saying stop and then the lights came on and he had stab wounds all over him and one big upward gash across his stomach/chest. He said he thought I was the killer and then there was a creepy laugh in the distance and a light turned off and I realised he wasn't the killer and I'd just injured the only help that I had. I had an intense feeling of dread and fear."
        }
    ]
}